export const OPENAI_MODELS = {
  GPT_4_O: 'gpt-4o',
  GPT_4_1_MINI: 'gpt-4.1-mini',
} as const;

export const OPENAI_PROMPTS = {
  ANALYZE_IMAGE: `Проаналізуй фото їжі:
  1. Знайди УСІ продукти та інгредієнти на фото.
  2. ОБОВ'ЯЗКОВО Відповідь дай у такому форматі:
  {
    "ingredients": [
    {
      name: "назва продукту",
      quantity: "приблизна вага продукту (лише число)",
      unit: "одиниця виміру (г, кг, мл, л тощо)"
    }
    ]
  }
  і більше нічого не пиши
  `,
  CALCULATE_NUTRIENTS: `Розрахуй поживні речовини для інредієнтів та дай відповідь у такому форматі:
  {
    "nutrients": [
    {
      name: "назва нутрієнту",
      quantity: "приблизна вага нутрієнту (лише число)",
      unit: "одиниця виміру (г, ккал)"
    }
    ]
  }
  і більше нічого не пиши
  `,
} as const;
